// ************************************************************************ //
// 警告
// -------
// このファイルで宣言されている型はタイプ ライブラリから読み取られたデータから
// 生成されています。このタイプ ライブラリが明示的あるいは（このタイプ ライブラ
// リを参照しているほかのタイプ ライブラリ経由で）間接的に再インポートされた
// り、タイプ ライブライブラリの編集中にタイプ ライブラリ エディタの［更新］コマ
// ンドを実行した場合、このファイルの内容はすべて再生成され、手動で加えた変更
// はすべて失われます。
// ************************************************************************ //

// $Rev: 34747 $
// 下に説明されたタイプ ライブラリから 2012/06/02 16:53:38 に生成されたファイル。

// ************************************************************************  //
// タイプ ライブラリ: E:\UserData\Kaz\Documents\RAD Studio\Projects\mp2enc\mp2dmoe\mp2dmoe (1)
// LIBID: {67FC4F6A-1F74-41AE-8F59-B0A174D394DF}
// LCID: 0
// ヘルプファイル:
// ヘルプ文字列:
// 依存関係リスト:
//   (1) v2.0 stdole, (C:\Windows\SysWOW64\stdole2.tlb)
// ************************************************************************ //

#include <vcl.h>
#pragma hdrstop

#include "mp2dmoe_TLB.h"

#if !defined(__PRAGMA_PACKAGE_SMART_INIT)
#define      __PRAGMA_PACKAGE_SMART_INIT
#pragma package(smart_init)
#endif

namespace Mp2dmoe_tlb
{

// *********************************************************************//
// タイプ ライブラリで宣言された GUID
// *********************************************************************//
const GUID LIBID_mp2dmoe = {0x67FC4F6A, 0x1F74, 0x41AE,{ 0x8F, 0x59, 0xB0,0xA1, 0x74, 0xD3,0x94, 0xDF} };

};     // namespace Mp2dmoe_tlb

