// ************************************************************************ //
// 警告
// -------
// このファイルで宣言されている型はタイプライブラリから読み取られたデータから
// 生成されています。このタイプライブラリが明示的あるいは（このタイプライブラ
// リを参照しているほかのタイプライブラリ経由で）間接的に再インポートされた
// り，タイプライブライブラリの編集中にタイプライブラリエディタの［更新］コマ
// ンドを実行した場合，このファイルの内容はすべて再生成され，手動で加えた変更
// はすべて失われます。
// ************************************************************************ //


// $Rev: 17252 $
// 下に説明されたタイプ ライブラリから 2010/06/12 21:02:32 に生成されたファイル。

// ************************************************************************  //
// タイプ ライブラリ: E:\UserData\Kaz\Documents\RAD Studio\Projects\mp2enc\id3mux\id3mux (1)
// LIBID: {F503A583-0F48-4671-A45B-32D889F22DCF}
// LCID: 0
// ヘルプファイル:
// ヘルプ文字列:
// 依存関係リスト:
//   (1) v2.0 stdole, (C:\Windows\system32\stdole2.tlb)
// ************************************************************************ //

#include <vcl.h>
#pragma hdrstop

#include "id3mux_TLB.h"

#if !defined(__PRAGMA_PACKAGE_SMART_INIT)
#define      __PRAGMA_PACKAGE_SMART_INIT
#pragma package(smart_init)
#endif

namespace Id3mux_tlb
{


// *********************************************************************//
// タイプライブラリで宣言された GUID
// *********************************************************************//
const GUID LIBID_id3mux = {0xF503A583, 0x0F48, 0x4671,{ 0xA4, 0x5B, 0x32,0xD8, 0x89, 0xF2,0x2D, 0xCF} };
const GUID IID_IConfigId3Mux = {0xF82FF012, 0x2B6A, 0x4CB8,{ 0x89, 0x89, 0x6D,0xCB, 0x5A, 0x6E,0xB4, 0x9A} };

};     // namespace Id3mux_tlb

